app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("contest", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["contest", "Este es un Microposteo desde mi PC"], ["user_id", 1], ["created_at", "2019-09-05 21:31:22.734515"], ["updated_at", "2019-09-05 21:31:22.734515"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save