app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @users = User.paginate(page: params[:page])